"""        
2차원 배열(리스트 2중)은 데이터를 빼오려면 for문 2중 구조를 쓴다.
"""

"""내 시도
ary = []    # 빈 리스트 생성

for i in range(1,6):
    line = []              # 안쪽 리스트로 사용할 빈 리스트 생성
    for j in range(1,6):
        line.append(i*j)     # 안쪽 리스트에 숫자 추가
    ary.append(line)         # 전체 리스트에 안쪽 리스트를 추가

print(ary)

answer
[[1, 2, 3, 4, 5], [2, 4, 6, 8, 10], [3, 6, 9, 12, 15], [4, 8, 12, 16, 20], [5, 10, 15, 20, 25]]"""

#선생님 풀이
# 1~25까지 숫자 나열

#1차_리스트의 형태는 아니지만 포맷은 맞음.
"""
for i in range(25):
    print(i+1, end=" ")
    if (i % 5 == 4):
        print()"""
"""answer
1 2 3 4 5 
6 7 8 9 10
11 12 13 14 15
16 17 18 19 20
21 22 23 24 25"""

#2차나열된 숫자가 원하는 숫자들이 아님.
"""
for i in range(5):
    for j in range(5):
        print("%2d" %j, end=" ")"""
"""answer
 0  1  2  3  4  0  1  2  3  4  0  1  2  3  4  0  1  2  3  4  0  1  2  3  4 """
        
#3차_나열된 숫자가 원하는 숫자들이 아님.
"""
for i in range(5):
    for j in range(5):
        print("%2d" %j, end=" ")
    print()                      ##한줄띄기"""
"""answer
 0  1  2  3  4 
 0  1  2  3  4
 0  1  2  3  4
 0  1  2  3  4
 0  1  2  3  4"""    
    
# 4차_나열된 숫자가 원하는 숫자들이 아님.     
"""
for i in range(5):
    for j in range(5):
        print("%2d" %(i+j), end=" ")
    print()"""
    
"""answer
 0  1  2  3  4 
 1  2  3  4  5
 2  3  4  5  6
 3  4  5  6  7
 4  5  6  7  8"""
 
#5차_성공하였으나 값이 나오는 식을 찾기 어려움.       
"""
for i in range(5):
    for j in range(5):
        print("%2d" %((5*i)+(j+1)), end=" ")
    print()"""
    
"""# 6차
cnt=0
for i in range(5):
    for j in range(5):
        cnt=cnt+1
        print("%2d" %(cnt), end=" ") 
    print()"""
"""answer
 1  2  3  4  5 
 6  7  8  9 10
11 12 13 14 15
16 17 18 19 20
21 22 23 24 25"""
    
# 7차
ary=[[],[],[],[],[]]
cnt = 0
for i in range(5):     #빈리스트를 가져올 index
    for j in range(5): #반복수
        cnt=cnt+1 
        ary[i].append(cnt)     #ary=[[],[],[],[],[]]
                               #      1  2  3  4  5  임시로 ary안의 요소를 명칭하였을 때,
                               # ary[0]=[1]번째 리스트 요소에 1,2,3,4,5이 들어간다. / ary[1] = [2]6,7,8,9,10
print(ary)
"""answer
[[1, 2, 3, 4, 5], [6, 7, 8, 9, 10], [11, 12, 13, 14, 15], [16, 17, 18, 19, 20], [21, 22, 23, 24, 25]]"""


for i in range(5):     
    for j in range(5): 
        print("%2d" %(ary[i][j]), end=" ") #ary[0]=[1,2,3,4,5] / ary[1] = [6,7,8,9,10]
    print()
"""answer
 1  2  3  4  5 
 6  7  8  9 10
11 12 13 14 15
16 17 18 19 20
21 22 23 24 25"""

# #8차
# ary=[[0,0,0,0,0],[0,0,0,0,0],[0,0,0,0,0],[0,0,0,0,0],[0,0,0,0,0]]
# cnt = 0
# for i in range(5):     #빈리스트를 가져올 index
#     for j in range(5): #반복수
#         cnt=cnt+1 
#         ary[i][j] = ary[i][j] + cnt
# print(ary)
# """answer
# [[1, 2, 3, 4, 5], [6, 7, 8, 9, 10], [11, 12, 13, 14, 15], [16, 17, 18, 19, 20], [21, 22, 23, 24, 25]]"""


# for i in range(5):     
#     for j in range(5): 
#         print("%2d" %(ary[i][j]), end=" ") #ary[0]=[1,2,3,4,5] / ary[1] = [6,7,8,9,10]
#     print()
# """answer
#  1  2  3  4  5 
#  6  7  8  9 10
# 11 12 13 14 15
# 16 17 18 19 20
# 21 22 23 24 25"""

# # 역순으로 출력하기.
# ary=[[],[],[],[],[]]
# cnt = 26
# for i in range(5):     #빈리스트를 가져올 index
#     for j in range(5): #반복수
#         cnt=cnt-1 
#         ary[i].append(cnt)     #ary[0]=[1]1,2,3,4,5 / ary[1] = [2]6,7,8,9,10
# print(ary)
# """answer
# [[25, 24, 23, 22, 21], [20, 19, 18, 17, 16], [15, 14, 13, 12, 11], [10, 9, 8, 7, 6], [5, 4, 3, 2, 1]]"""


# for i in range(5):     
#     for j in range(5): 
#         print("%2d" %(ary[i][j]), end=" ") #ary[0]=[1,2,3,4,5] / ary[1] = [6,7,8,9,10]
#     print()
# """answer
# 25 24 23 22 21
# 20 19 18 17 16
# 15 14 13 12 11
# 10  9  8  7  6
#  5  4  3  2  1"""
