menu_type =["김밥", "돈까스", "set", "분식", "식사", "국밥", "사이드메뉴"]

# menu =[ ["김밥","원조김밥 2,500", "김치김밥 3,000","참치김밥 3,000" ],
#         ["돈까스", "돈까스 7,000", "더블돈까스 9,000", "치킨까스 7,500" ],
#         ["set", "돈떡원조캔 16,000", "돈떡쫄 16,000", ""],
#         ["분식","유부우동 5,000", "오뎅 4,000", "바지락칼국수 6,000"],
#         ["식사","카레덮밥 6,000", "참치덮밥 6,500", "소불고기덮밥 6,500"],
#         ["국밥", "콩나물국밥 6,000", "육개장 7,000", "갈비탕 7,000"],
#         ["사이드메뉴", "콜라250 1,000", "사이다250 1,000", "콜라1.25 3,000"]]

menu_show =[ ["김밥", "돈까스", "set", "분식", "식사", "국밥", "사이드메뉴"],
        ["1. 원조김밥 2,500", "4. 돈까스    7,000", "7. 돈떡원조캔 16,000", "9. 유부우동    5,000", "12.카레덮밥     6,000", "15.콩나물국밥 6,000", "18.콜라250   1,000"],
        ["2. 김치김밥 3,000", "5. 더블돈까스 9,000", "8. 돈떡쫄    16,000", "10.오뎅        4,000", "13.참치덮밥     6,500", "16.육개장    7,000", "19.사이다250 1,000", ],
        ["3. 참치김밥 3,000", "6. 치킨까스   7,500", "                  ", "11.바지락칼국수 6,000", "14.소불고기덮밥  6,500", "17.갈비탕    7,000", "20.콜라1.25  3,000"]]


#메뉴판 보여주기
for i in range(4):          
    for j in range(7): 
        print("%15s" %(menu_show[i][j]), end="  ") 
        j=j+1   
    print()
    i=i+1 
print()
   

#메뉴번호에 맞는 주문받기
menu_name ={1:"원조김밥", 2:"김치김밥", 3:"참치김밥", 
            4:"돈까스", 5:"더블돈까스", 6:"치킨까스", 
            7:"돈떡원조캔", 8:"돈떡쫄", 
            9:"유부우동", 10:"오뎅", 11:"바지락칼국수",
            12:"카레덮밥", 13:"참치덮밥", 14:"소불고기덮밥",
            15:"콩나물국밥", 16:"육개장", 17:"갈비탕",
            18:"콜라250", 19:"사이다250", 20:"콜라1.25", 0:"결제하기"}


# menu_price ={"원조김밥":2500, "김치김밥":3000, "참치김밥":3000, 
#             "돈까스":7000, "더블돈까스":9000, "치킨까스":7500, 
#             "돈떡원조캔": 16000, "돈떡쫄":16000, 
#             "유부우동":5000, "오뎅":4500, "바지락칼국수":6000,
#             "카레덮밥":6000, "참치덮밥":6500, "소불고기덮밥":6000,
#             "콩나물국밥":6000, "육개장":7000, "갈비탕":7000,
#             "콜라250":1000, "사이다250":1000, "콜라1.25":1000}

menu_price ={1:2500, 2:3000, 3:3000, 
            4:7000, 5:9000, 6:7500, 
            7: 16000, 8:16000, 
            9:5000, 10:4500, 11:6000,
            12:6000, 13:6500, 14:6000,
            15:6000, 16:7000, 17:7000,
            18:1000, 19:1000, 20:1000}


choose = """
1. 원하는 메뉴의 번호를 누르거나 결제를 원하신다면 숫자0을 눌러주세요 :"""

print("="*100) 
menu_choice=int(input (choose))

price=0
order = []
while menu_choice != 0:
    order.append(menu_name[menu_choice])
    price= price + menu_price[menu_choice]
    print(f'주문 내역 : {order}')
    print(f'주문 합계 : {price}')
    menu_choice=int(input (choose))
    
print("="*100) 

pay_method = """
1. 현금
2. 카드
결제방법을 선택해주세요 :"""

print(f'주문 내역 : {order}')
print(f'주문 합계 : {price}')
pay_choice=int(input (pay_method))
print("="*100)

if pay_choice == 1 :
    money =int(input ("돈을 넣어주세요: "))    
    if money < price:
        print(input(f'총액보다 적어 돈을 반환합니다. : {money}'))
    elif money == price :
        print(input(f'잔액 : ({money}-{price})'))
        print(input("주문이 완료되었습니다."))
       
    else: # money > price
        print(input("주문이 완료되었습니다."))
        print(input(f'잔액을 받아주세요. : ({money}-{price})'))
else : 
    print(input("카드 결제가 완료되었습니다."))

    
